Revit 2027 API
IFCData.HasValue Property
 Identifies if the data is empty or contains a value.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasValue { get; }
Public ReadOnly Property HasValue As Boolean
	Get
public:
property bool HasValue {
	bool get ();
}
member HasValue : bool with get
Property Value
Boolean
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace